
nc: 4
depth_multiple: 0.25
width_multiple: 0.125
anchors: 3

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]         # P1/2
  - [-1, 1, Conv,  [128, 3, 2]]        # P2/4
  - [-1, 1, C2f,   [128, True]]
  - [-1, 1, Conv,  [256, 3, 2]]        # P3/8
  - [-1, 2, C2f,   [256, True]]
  - [-1, 1, Conv,  [384, 3, 2]]        # P4/16
  - [-1, 2, C2f,   [384, True]]
  - [-1, 1, Conv,  [512, 3, 2]]        # P5/32
  - [-1, 1, C2f,   [512, True]]
  - [-1, 1, SPPF,  [512, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C2f,   [384, False]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C2f,   [256, False]]
  - [-1, 1, Conv,  [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C2f,   [384, False]]
  - [-1, 1, Conv,  [384, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C2f,   [512, False]]
  - [[15, 18, 21], 1, Detect, [nc]]
